{
  "nodes": [
    {
      "op": "null",
      "name": "Q",
      "inputs": []
    },
    {
      "op": "null",
      "name": "K",
      "inputs": []
    },
    {
      "op": "null",
      "name": "V",
      "inputs": []
    },
    {
      "op": "sdpa_fwd_bf16",
      "name": "SDPA",
      "attrs": {
        "input:0": "Q  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "input:1": "K  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "input:2": "V  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  ",
        "output_0": "Y  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  userMemorySection(type=Persistent, id=7)  |  ",
        "output_1": "Z  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  userMemorySection(type=Persistent, id=8)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1,
    2
  ],
  "node_row_ptr": [0, 1, 2, 3],
  "heads": [[3, 0, 0], [3, 1, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}