{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "Reshape",
      "name": "Reshape5",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "tensor_8  |  bf16  |  Sizes = [1,1,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 1048576, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "null",
      "name": "tensor_1_/placeholder/1",
      "inputs": []
    },
    {
      "op": "null",
      "name": "tensor_2_/placeholder/2",
      "inputs": []
    },
    {
      "op": "fused_kernel_0x3D0305CA_1_f32",
      "name": "fusedTPCNode_0_0",
      "attrs": {
        "input:0": "tensor_8  |  bf16  |  Sizes = [1,1,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 1048576, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "input:1": "tensor_1_/placeholder/1  |  float32  |  Sizes = [4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16384, 4]  |  data = 0, sizeInBytes = 16384  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "input:2": "tensor_2_/placeholder/2  |  float32  |  Sizes = [4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16384, 4]  |  data = 0, sizeInBytes = 16384  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x60000000000  |  userMemorySection(type=Persistent, id=6)  |  ",
        "output_0": "tensor_9  |  bf16  |  Sizes = [1,1,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 1048576, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_3_id_18_aten__native_layer_norm, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "Reshape7",
      "attrs": {
        "input:0": "tensor_9  |  bf16  |  Sizes = [1,1,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 1048576, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_3_id_18_aten__native_layer_norm, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "tensor_3_id_18_aten__native_layer_norm  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x70000000000  |  userMemorySection(type=Persistent, id=7)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"2"
      },
      "inputs": [[4, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    2,
    3
  ],
  "node_row_ptr": [0, 1, 2, 3, 4, 5],
  "heads": [[5, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}