{
  "nodes": [
    {
      "op": "null",
      "name": "S",
      "inputs": []
    },
    {
      "op": "argmax_fwd_u8",
      "name": "Argmax",
      "attrs": {
        "input:0": "S  |  uint8  |  Sizes = [32,32000]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1024000, 32000, 1]  |  data = 0, sizeInBytes = 1024000  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "O  |  int32  |  Sizes = [32,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [128, 4, 4]  |  data = 0, sizeInBytes = 128  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    }
  ],
  "arg_nodes": [
    0
  ],
  "node_row_ptr": [0, 1],
  "heads": [[1, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}