{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "argmax_fwd_bf16",
      "name": "TPC3",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  bf16  |  Sizes = [32,32000]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2048000, 64000, 2]  |  data = 0, sizeInBytes = 2048000  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "tensor_2  |  int32  |  Sizes = [32,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [128, 4, 4]  |  data = 0, sizeInBytes = 128  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "Reshape4",
      "attrs": {
        "input:0": "tensor_2  |  int32  |  Sizes = [32,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [128, 4, 4]  |  data = 0, sizeInBytes = 128  |  ",
        "output_0": "tensor_1_id_5_aten__argmax  |  int32  |  Sizes = [32]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [128, 4]  |  data = 0, sizeInBytes = 128  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[1, 0, 0]]
    }
  ],
  "arg_nodes": [
    0
  ],
  "node_row_ptr": [0, 1, 2],
  "heads": [[2, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}