{
  "nodes": [
    {
      "op": "null",
      "name": "A",
      "inputs": []
    },
    {
      "op": "null",
      "name": "B",
      "inputs": []
    },
    {
      "op": "BatchGemm",
      "name": "BatchGemm",
      "attrs": {
        "input:0": "A  |  float16  |  Sizes = [64,32,1,128]  |  expBias = 15, scale = 1  |    |  ModelParam = 0  |  strides = [524288, 8192, 256, 256, 2]  |  data = 0, sizeInBytes = 524288  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "input:1": "B  |  float16  |  Sizes = [64,32,1024,128]  |  expBias = 15, scale = 1  |    |  ModelParam = 0  |  strides = [536870912, 8388608, 262144, 256, 2]  |  data = 0, sizeInBytes = 536870912  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "C  |  float16  |  Sizes = [64,32,1,1024]  |  expBias = 15, scale = 1  |    |  ModelParam = 0  |  strides = [4194304, 65536, 2048, 2048, 2]  |  data = 0, sizeInBytes = 4194304  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  ",
        "Parameters": "transpose_a=false, transpose_b=true",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1
  ],
  "node_row_ptr": [0, 1, 2],
  "heads": [[2, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}