{
  "nodes": [
    {
      "op": "null",
      "name": "X",
      "inputs": []
    },
    {
      "op": "cast_f16_to_bf16",
      "name": "softsign_fwd_bf16_11_0_complex/cast_f16_to_bf16_0",
      "attrs": {
        "input:0": "X  |  float16  |  Sizes = [64,128,4096]  |  expBias = 15, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "bf16-1_4419  |  bf16  |  Sizes = [64,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "softsign_fwd_bf16",
      "name": "softsign_fwd_bf16_11_0_complex/softsign_fwd_bf16_2_complex/softsign_fwd_bf16_0",
      "attrs": {
        "input:0": "bf16-1_4419  |  bf16  |  Sizes = [64,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "output_0": "bf16-3_4420  |  bf16  |  Sizes = [64,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  isAliased = bf16-1_4419, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[1, 0, 0]]
    },
    {
      "op": "cast_bf16_to_f16",
      "name": "softsign_fwd_bf16_11_0_complex/cast_bf16_to_f16_4",
      "attrs": {
        "input:0": "bf16-3_4420  |  bf16  |  Sizes = [64,128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  isAliased = bf16-1_4419, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "Y  |  float16  |  Sizes = [64,128,4096]  |  expBias = 15, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 8192, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"2"
      },
      "inputs": [[2, 0, 0]]
    }
  ],
  "arg_nodes": [
    0
  ],
  "node_row_ptr": [0, 1, 2, 3],
  "heads": [[3, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}