{
  "nodes": [
    {
      "op": "null",
      "name": "K",
      "inputs": []
    },
    {
      "op": "Split",
      "name": "K_bundle_0/split_internal/0",
      "attrs": {
        "input:0": "K  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "K_0_0_0_0_0_memcpy_200  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_1": "K_0_0_0_1_0_memcpy_201  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_2": "K_0_0_0_2_0_memcpy_202  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_3": "K_0_0_0_3_0_memcpy_203  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Bundle_idx": "0",
        "Op_idx":"0",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "null",
      "name": "Q",
      "inputs": []
    },
    {
      "op": "Split",
      "name": "Q_bundle_0/split_internal/0",
      "attrs": {
        "input:0": "Q  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "Q_slice_0_0_0_0_0__0__bundle_0_188  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_1": "Q_slice_0_0_0_1_0__0__bundle_0_191  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_2": "Q_slice_0_0_0_2_0__0__bundle_0_194  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_3": "Q_slice_0_0_0_3_0__0__bundle_0_197  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Bundle_idx": "0",
        "Op_idx":"1",
        "Exec_idx":"1"
      },
      "inputs": [[2, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "K_bundle_0/memcpy/0",
      "attrs": {
        "input:0": "K_0_0_0_0_0_memcpy_200  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_0": "K_slice_0_0_0_0_0__0__bundle_0_189  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "Bundle_idx": "0",
        "Op_idx":"2",
        "Exec_idx":"2"
      },
      "inputs": [[1, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "K_bundle_0/memcpy/1",
      "attrs": {
        "input:0": "K_0_0_0_1_0_memcpy_201  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_0": "K_slice_0_0_0_1_0__0__bundle_0_192  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "Bundle_idx": "0",
        "Op_idx":"3",
        "Exec_idx":"3"
      },
      "inputs": [[1, 1, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_13_bundle_0/op_0",
      "attrs": {
        "input:0": "Q_slice_0_0_0_0_0__0__bundle_0_188  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 0  |  location = in DRAM  |  ",
        "input:1": "K_slice_0_0_0_0_0__0__bundle_0_189  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "output_0": "bf16-14_10_slice_0_0_0_0_0__0__bundle_0_190  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 0  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=true",
        "Bundle_idx": "0",
        "Op_idx":"4",
        "Exec_idx":"4"
      },
      "inputs": [[3, 0, 0], [4, 0, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_13_bundle_0/op_1",
      "attrs": {
        "input:0": "Q_slice_0_0_0_1_0__0__bundle_0_191  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "input:1": "K_slice_0_0_0_1_0__0__bundle_0_192  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "output_0": "bf16-14_10_slice_0_0_0_1_0__0__bundle_0_193  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=true",
        "Bundle_idx": "0",
        "Op_idx":"5",
        "Exec_idx":"5"
      },
      "inputs": [[3, 1, 0], [5, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "K_bundle_0/memcpy/2",
      "attrs": {
        "input:0": "K_0_0_0_2_0_memcpy_202  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_0": "K_slice_0_0_0_2_0__0__bundle_0_195  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "Bundle_idx": "0",
        "Op_idx":"6",
        "Exec_idx":"6"
      },
      "inputs": [[1, 2, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "K_bundle_0/memcpy/3",
      "attrs": {
        "input:0": "K_0_0_0_3_0_memcpy_203  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = K, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "K_slice_0_0_0_3_0__0__bundle_0_198  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "Bundle_idx": "0",
        "Op_idx":"7",
        "Exec_idx":"7"
      },
      "inputs": [[1, 3, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_13_bundle_0/op_2",
      "attrs": {
        "input:0": "Q_slice_0_0_0_2_0__0__bundle_0_194  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "input:1": "K_slice_0_0_0_2_0__0__bundle_0_195  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "output_0": "bf16-14_10_slice_0_0_0_2_0__0__bundle_0_196  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=true",
        "Bundle_idx": "0",
        "Op_idx":"8",
        "Exec_idx":"8"
      },
      "inputs": [[3, 2, 0], [8, 0, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_13_bundle_0/op_3",
      "attrs": {
        "input:0": "Q_slice_0_0_0_3_0__0__bundle_0_197  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Q, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "input:1": "K_slice_0_0_0_3_0__0__bundle_0_198  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "output_0": "bf16-14_10_slice_0_0_0_3_0__0__bundle_0_199  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=true",
        "Bundle_idx": "0",
        "Op_idx":"9",
        "Exec_idx":"9"
      },
      "inputs": [[3, 3, 0], [9, 0, 0]]
    },
    {
      "op": "Concatenate",
      "name": "bf16-14_10_bundle_0/concat_logical_internal/0",
      "attrs": {
        "input:0": "bf16-14_10_slice_0_0_0_0_0__0__bundle_0_190  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 0  |  location = in DRAM  |  ",
        "input:1": "bf16-14_10_slice_0_0_0_1_0__0__bundle_0_193  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "input:2": "bf16-14_10_slice_0_0_0_2_0__0__bundle_0_196  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "input:3": "bf16-14_10_slice_0_0_0_3_0__0__bundle_0_199  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "bf16-14_10  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "Bundle_idx": "0",
        "Op_idx":"10",
        "Exec_idx":"10"
      },
      "inputs": [[6, 0, 0], [7, 0, 0], [10, 0, 0], [11, 0, 0]]
    },
    {
      "op": "Split",
      "name": "bf16-14_10_bundle_1/split_internal/0",
      "attrs": {
        "input:0": "bf16-14_10  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "output_0": "bf16-14_10_slice_0_0_0_0_0__0__bundle_1_204  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_1": "bf16-14_10_slice_0_0_0_1_0__0__bundle_1_206  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_2": "bf16-14_10_slice_0_0_0_2_0__0__bundle_1_210  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_3": "bf16-14_10_slice_0_0_0_3_0__0__bundle_1_214  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"0",
        "Exec_idx":"11"
      },
      "inputs": [[12, 0, 0]]
    },
    {
      "op": "null",
      "name": "V",
      "inputs": []
    },
    {
      "op": "Split",
      "name": "V_bundle_1/split_internal/0",
      "attrs": {
        "input:0": "V  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x60000000000  |  userMemorySection(type=Persistent, id=6)  |  ",
        "output_0": "V_slice_0_0_0_0_0__0__bundle_1_208  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_1": "V_slice_0_0_0_1_0__0__bundle_1_212  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_2": "V_slice_0_0_0_2_0__0__bundle_1_216  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_3": "V_slice_0_0_0_3_0__0__bundle_1_218  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"1",
        "Exec_idx":"12"
      },
      "inputs": [[14, 0, 0]]
    },
    {
      "op": "scaled_masked_triangular_softmax_fwd_bf16",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/scaled_masked_triangular_softmax_fwd_bf16_15_bundle_1/op_0",
      "attrs": {
        "input:0": "bf16-14_10_slice_0_0_0_0_0__0__bundle_1_204  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_0": "Z_slice_0_0_0_0_0__0__bundle_1_205  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "Bundle_idx": "1",
        "Op_idx":"2",
        "Exec_idx":"13"
      },
      "inputs": [[13, 0, 0]]
    },
    {
      "op": "scaled_masked_triangular_softmax_fwd_bf16",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/scaled_masked_triangular_softmax_fwd_bf16_15_bundle_1/op_1",
      "attrs": {
        "input:0": "bf16-14_10_slice_0_0_0_1_0__0__bundle_1_206  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_0": "Z_slice_0_0_0_1_0__0__bundle_1_207  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "Bundle_idx": "1",
        "Op_idx":"3",
        "Exec_idx":"14"
      },
      "inputs": [[13, 1, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_16_bundle_1/op_2",
      "attrs": {
        "input:0": "Z_slice_0_0_0_0_0__0__bundle_1_205  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "input:1": "V_slice_0_0_0_0_0__0__bundle_1_208  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 0  |  location = in DRAM  |  ",
        "output_0": "Y_slice_0_0_0_0_0__0__bundle_1_209  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 0  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=false",
        "Bundle_idx": "1",
        "Op_idx":"4",
        "Exec_idx":"15"
      },
      "inputs": [[16, 0, 0], [15, 0, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_16_bundle_1/op_4",
      "attrs": {
        "input:0": "Z_slice_0_0_0_1_0__0__bundle_1_207  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "input:1": "V_slice_0_0_0_1_0__0__bundle_1_212  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "output_0": "Y_slice_0_0_0_1_0__0__bundle_1_213  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=false",
        "Bundle_idx": "1",
        "Op_idx":"5",
        "Exec_idx":"16"
      },
      "inputs": [[17, 0, 0], [15, 1, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "Z_bundle_1/memcpy/0",
      "attrs": {
        "input:0": "Z_slice_0_0_0_0_0__0__bundle_1_205  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "output_0": "Z_0_0_0_0_0_memcpy_220  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"6",
        "Exec_idx":"17"
      },
      "inputs": [[16, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "Z_bundle_1/memcpy/1",
      "attrs": {
        "input:0": "Z_slice_0_0_0_1_0__0__bundle_1_207  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "output_0": "Z_0_0_0_1_0_memcpy_221  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"7",
        "Exec_idx":"18"
      },
      "inputs": [[17, 0, 0]]
    },
    {
      "op": "scaled_masked_triangular_softmax_fwd_bf16",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/scaled_masked_triangular_softmax_fwd_bf16_15_bundle_1/op_3",
      "attrs": {
        "input:0": "bf16-14_10_slice_0_0_0_2_0__0__bundle_1_210  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_0": "Z_slice_0_0_0_2_0__0__bundle_1_211  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "Bundle_idx": "1",
        "Op_idx":"8",
        "Exec_idx":"19"
      },
      "inputs": [[13, 2, 0]]
    },
    {
      "op": "scaled_masked_triangular_softmax_fwd_bf16",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/scaled_masked_triangular_softmax_fwd_bf16_15_bundle_1/op_5",
      "attrs": {
        "input:0": "bf16-14_10_slice_0_0_0_3_0__0__bundle_1_214  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = bf16-14_10, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "Z_slice_0_0_0_3_0__0__bundle_1_215  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "Bundle_idx": "1",
        "Op_idx":"9",
        "Exec_idx":"20"
      },
      "inputs": [[13, 3, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_16_bundle_1/op_6",
      "attrs": {
        "input:0": "Z_slice_0_0_0_2_0__0__bundle_1_211  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "input:1": "V_slice_0_0_0_2_0__0__bundle_1_216  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "output_0": "Y_slice_0_0_0_2_0__0__bundle_1_217  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=false",
        "Bundle_idx": "1",
        "Op_idx":"10",
        "Exec_idx":"21"
      },
      "inputs": [[22, 0, 0], [15, 2, 0]]
    },
    {
      "op": "BatchGemm",
      "name": "SDPA_complex/sdpa_fwd_bf16_1/sdpa_core_fwd_bf16_0/batch_gemm_16_bundle_1/op_7",
      "attrs": {
        "input:0": "Z_slice_0_0_0_3_0__0__bundle_1_215  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "input:1": "V_slice_0_0_0_3_0__0__bundle_1_218  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = V, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "Y_slice_0_0_0_3_0__0__bundle_1_219  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Parameters": "transpose_a=false, transpose_b=false",
        "Bundle_idx": "1",
        "Op_idx":"11",
        "Exec_idx":"22"
      },
      "inputs": [[23, 0, 0], [15, 3, 0]]
    },
    {
      "op": "Concatenate",
      "name": "Y_bundle_1/concat_logical_internal/0",
      "attrs": {
        "input:0": "Y_slice_0_0_0_0_0__0__bundle_1_209  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 0  |  location = in DRAM  |  ",
        "input:1": "Y_slice_0_0_0_1_0__0__bundle_1_213  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "input:2": "Y_slice_0_0_0_2_0__0__bundle_1_217  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "input:3": "Y_slice_0_0_0_3_0__0__bundle_1_219  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Y, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "Y  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x70000000000  |  userMemorySection(type=Persistent, id=7)  |  ",
        "Bundle_idx": "1",
        "Op_idx":"12",
        "Exec_idx":"23"
      },
      "inputs": [[18, 0, 0], [19, 0, 0], [24, 0, 0], [25, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "Z_bundle_1/memcpy/2",
      "attrs": {
        "input:0": "Z_slice_0_0_0_2_0__0__bundle_1_211  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffd050000  |  ",
        "output_0": "Z_0_0_0_2_0_memcpy_222  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"13",
        "Exec_idx":"24"
      },
      "inputs": [[22, 0, 0]]
    },
    {
      "op": "DmaMemcpy",
      "name": "Z_bundle_1/memcpy/3",
      "attrs": {
        "input:0": "Z_slice_0_0_0_3_0__0__bundle_1_215  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16777216, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  location = in SRAM  |  sramOffset = 0x1000fffffe050000  |  ",
        "output_0": "Z_0_0_0_3_0_memcpy_223  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "Bundle_idx": "1",
        "Op_idx":"14",
        "Exec_idx":"25"
      },
      "inputs": [[23, 0, 0]]
    },
    {
      "op": "Concatenate",
      "name": "Z_bundle_1/concat_logical_internal/0",
      "attrs": {
        "input:0": "Z_0_0_0_0_0_memcpy_220  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 0  |  location = in DRAM  |  ",
        "input:1": "Z_0_0_0_1_0_memcpy_221  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 16777216  |  location = in DRAM  |  ",
        "input:2": "Z_0_0_0_2_0_memcpy_222  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 33554432  |  location = in DRAM  |  ",
        "input:3": "Z_0_0_0_3_0_memcpy_223  |  bf16  |  Sizes = [16,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 16777216  |  isAliased = Z, type = concat, offset: 50331648  |  location = in DRAM  |  ",
        "output_0": "Z  |  bf16  |  Sizes = [64,32,128,128]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [67108864, 1048576, 32768, 256, 2]  |  data = 0, sizeInBytes = 67108864  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x80000000000  |  userMemorySection(type=Persistent, id=8)  |  ",
        "Bundle_idx": "1",
        "Op_idx":"15",
        "Exec_idx":"26"
      },
      "inputs": [[20, 0, 0], [21, 0, 0], [27, 0, 0], [28, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    2,
    14
  ],
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
  "heads": [[26, 0, 0], [29, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}