{
  "nodes": [
    {
      "op": "null",
      "name": "X",
      "inputs": []
    },
    {
      "op": "fused_kernel_0x9C5A3A92_1_f32",
      "name": "fusedTPCNode_0_0",
      "attrs": {
        "input:0": "X  |  hfloat8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "f8-3_549  |  float8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isAliased = f8-9_552, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "null",
      "name": "S",
      "inputs": []
    },
    {
      "op": "fused_kernel_0x91ED6E68_2_f32",
      "name": "fusedTPCNode_0_1",
      "attrs": {
        "input:0": "S  |  hfloat8  |  Sizes = [64,1,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [262144, 4096, 4096, 1]  |  data = 0, sizeInBytes = 262144  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x60000000000  |  userMemorySection(type=Persistent, id=6)  |  ",
        "output_0": "f8-7_551  |  float8  |  Sizes = [64,1,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [262144, 4096, 4096, 1]  |  data = 0, sizeInBytes = 262144  |  location = in DRAM  |  dramOffset = 0x70000000000  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[2, 0, 0]]
    },
    {
      "op": "null",
      "name": "I",
      "inputs": []
    },
    {
      "op": "index_copy_fwd_f8",
      "name": "Index_Copy_complex/index_copy_fwd_f8_8",
      "attrs": {
        "input:0": "f8-3_549  |  float8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isAliased = f8-9_552, type = alias, offset: 0  |  location = in DRAM  |  ",
        "input:1": "I  |  int32  |  Sizes = [1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "input:2": "f8-7_551  |  float8  |  Sizes = [64,1,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [262144, 4096, 4096, 1]  |  data = 0, sizeInBytes = 262144  |  location = in DRAM  |  dramOffset = 0x70000000000  |  ",
        "output_0": "f8-9_552  |  float8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"2"
      },
      "inputs": [[1, 0, 0], [4, 0, 0], [3, 0, 0]]
    },
    {
      "op": "fused_kernel_0x9C5A3A92_3_f32",
      "name": "fusedTPCNode_0_2",
      "attrs": {
        "input:0": "f8-9_552  |  float8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  location = in DRAM  |  dramOffset = 0x0  |  ",
        "output_0": "Y  |  hfloat8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x70000000000  |  userMemorySection(type=Persistent, id=7)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"3"
      },
      "inputs": [[5, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    2,
    4
  ],
  "node_row_ptr": [0, 1, 2, 3, 4, 5, 6],
  "heads": [[6, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}