{
  "nodes": [
    {
      "op": "null",
      "name": "X",
      "inputs": []
    },
    {
      "op": "null",
      "name": "I",
      "inputs": []
    },
    {
      "op": "gather_bf16",
      "name": "Gather_bf16_1_complex/gather_bf16_0",
      "attrs": {
        "input:0": "X  |  bf16  |  Sizes = [4096,500]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4096000, 1000, 2]  |  data = 0, sizeInBytes = 4096000  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "input:1": "I  |  int32  |  Sizes = [1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "Y  |  bf16  |  Sizes = [4096,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [8192, 2, 2]  |  data = 0, sizeInBytes = 8192  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x60000000000  |  userMemorySection(type=Persistent, id=6)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1
  ],
  "node_row_ptr": [0, 1, 2],
  "heads": [[2, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}