{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "null",
      "name": "tensor_1_/placeholder/1",
      "inputs": []
    },
    {
      "op": "embedding_pt_fwd_bf16",
      "name": "TPC56",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  bf16  |  Sizes = [10,64]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1280, 128, 2]  |  data = 0, sizeInBytes = 1280  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "input:1": "tensor_1_/placeholder/1  |  int32  |  Sizes = [32,4]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 16, 4]  |  data = 0, sizeInBytes = 512  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "tensor_2_id_25_aten__embedding  |  bf16  |  Sizes = [32,4,64]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16384, 512, 128, 2]  |  data = 0, sizeInBytes = 16384  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1
  ],
  "node_row_ptr": [0, 1, 2],
  "heads": [[2, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}