{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "softmax_fwd_bf16",
      "name": "TPC61",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "tensor_1_id_18_aten___softmax  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    }
  ],
  "arg_nodes": [
    0
  ],
  "node_row_ptr": [0, 1],
  "heads": [[1, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}