{
  "nodes": [
    {
      "op": "null",
      "name": "X",
      "inputs": []
    },
    {
      "op": "null",
      "name": "I",
      "inputs": []
    },
    {
      "op": "null",
      "name": "S",
      "inputs": []
    },
    {
      "op": "index_copy_fwd_f8",
      "name": "Index_Copy",
      "attrs": {
        "input:0": "X  |  hfloat8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isPersistent  |  userMemorySection(type=Persistent, id=4)  |  ",
        "input:1": "I  |  int32  |  Sizes = [1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [4, 4]  |  data = 0, sizeInBytes = 4  |  isPersistent  |  userMemorySection(type=Persistent, id=5)  |  ",
        "input:2": "S  |  hfloat8  |  Sizes = [64,1,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [262144, 4096, 4096, 1]  |  data = 0, sizeInBytes = 262144  |  isPersistent  |  userMemorySection(type=Persistent, id=6)  |  ",
        "output_0": "Y  |  hfloat8  |  Sizes = [64,128,4096]  |  expBias = 7, scale = 1  |    |  ModelParam = 0  |  strides = [33554432, 524288, 4096, 1]  |  data = 0, sizeInBytes = 33554432  |  isPersistent  |  userMemorySection(type=Persistent, id=7)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }
  ],
  "arg_nodes": [
    0,
    1,
    2
  ],
  "node_row_ptr": [0, 1, 2, 3],
  "heads": [[3, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}