{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "Reshape",
      "name": "TPC3_complex/rms_norm_ex_fwd_bf16_1/reshape_9",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "bf16-10_9  |  bf16  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "null",
      "name": "tensor_1_/placeholder/1",
      "inputs": []
    },
    {
      "op": "rms_norm_fwd_bf16",
      "name": "TPC3_complex/rms_norm_ex_fwd_bf16_1/rms_norm_fwd_bf16_11",
      "attrs": {
        "input:0": "bf16-10_9  |  bf16  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "input:1": "tensor_1_/placeholder/1  |  bf16  |  Sizes = [4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [8192, 2]  |  data = 0, sizeInBytes = 8192  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "bf16-12_10  |  bf16  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_4, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_1": "f32-13_11  |  float32  |  Sizes = [128,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 4, 4]  |  data = 0, sizeInBytes = 512  |  isAliased = tensor_5, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[1, 0, 0], [2, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "TPC3_complex/rms_norm_ex_fwd_bf16_1/reshape_14",
      "attrs": {
        "input:0": "bf16-12_10  |  bf16  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isAliased = tensor_4, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "tensor_4  |  bf16  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [1048576, 16384, 8192, 2]  |  data = 0, sizeInBytes = 1048576  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x80000000000  |  userMemorySection(type=Persistent, id=8)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"2"
      },
      "inputs": [[3, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "TPC3_complex/rms_norm_ex_fwd_bf16_1/reshape_15",
      "attrs": {
        "input:0": "f32-13_11  |  float32  |  Sizes = [128,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 4, 4]  |  data = 0, sizeInBytes = 512  |  isAliased = tensor_5, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "tensor_5  |  float32  |  Sizes = [64,2,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 8, 4, 4]  |  data = 0, sizeInBytes = 512  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x90000000000  |  userMemorySection(type=Persistent, id=9)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"3"
      },
      "inputs": [[3, 1, 0]]
    }
  ],
  "arg_nodes": [
    0,
    2
  ],
  "node_row_ptr": [0, 1, 2, 3, 4, 5],
  "heads": [[4, 0, 0], [5, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}