{
  "nodes": [
    {
      "op": "null",
      "name": "tensor_0_/placeholder/0",
      "inputs": []
    },
    {
      "op": "Reshape",
      "name": "TPC64_complex/rms_norm_ex_fwd_f32_3/reshape_4",
      "attrs": {
        "input:0": "tensor_0_/placeholder/0  |  float32  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 32768, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x40000000000  |  userMemorySection(type=Persistent, id=4)  |  ",
        "output_0": "f32-5_199  |  float32  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"0"
      },
      "inputs": [[0, 0, 0]]
    },
    {
      "op": "null",
      "name": "tensor_1_/placeholder/1",
      "inputs": []
    },
    {
      "op": "rms_norm_fwd_f32",
      "name": "TPC64_complex/rms_norm_ex_fwd_f32_3/rms_norm_fwd_f32_6",
      "attrs": {
        "input:0": "f32-5_199  |  float32  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isAliased = tensor_0_/placeholder/0, type = alias, offset: 0  |  location = in DRAM  |  ",
        "input:1": "tensor_1_/placeholder/1  |  float32  |  Sizes = [4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [16384, 4]  |  data = 0, sizeInBytes = 16384  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x50000000000  |  userMemorySection(type=Persistent, id=5)  |  ",
        "output_0": "f32-7_200  |  float32  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isAliased = tensor_4, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_1": "f32-8_201  |  float32  |  Sizes = [128,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 4, 4]  |  data = 0, sizeInBytes = 512  |  isAliased = tensor_5, type = alias, offset: 0  |  location = in DRAM  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"1"
      },
      "inputs": [[1, 0, 0], [2, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "TPC64_complex/rms_norm_ex_fwd_f32_3/reshape_9",
      "attrs": {
        "input:0": "f32-7_200  |  float32  |  Sizes = [128,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isAliased = tensor_4, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "tensor_4  |  float32  |  Sizes = [64,2,4096]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [2097152, 32768, 16384, 4]  |  data = 0, sizeInBytes = 2097152  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x80000000000  |  userMemorySection(type=Persistent, id=8)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"2"
      },
      "inputs": [[3, 0, 0]]
    },
    {
      "op": "Reshape",
      "name": "TPC64_complex/rms_norm_ex_fwd_f32_3/reshape_10",
      "attrs": {
        "input:0": "f32-8_201  |  float32  |  Sizes = [128,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 4, 4]  |  data = 0, sizeInBytes = 512  |  isAliased = tensor_5, type = alias, offset: 0  |  location = in DRAM  |  ",
        "output_0": "tensor_5  |  float32  |  Sizes = [64,2,1]  |  expBias = 0, scale = 1  |    |  ModelParam = 0  |  strides = [512, 8, 4, 4]  |  data = 0, sizeInBytes = 512  |  isPersistent  |  location = in DRAM  |  dramOffset = 0x90000000000  |  userMemorySection(type=Persistent, id=9)  |  ",
        "Bundle_idx": "N/A",
        "Exec_idx":"3"
      },
      "inputs": [[3, 1, 0]]
    }
  ],
  "arg_nodes": [
    0,
    2
  ],
  "node_row_ptr": [0, 1, 2, 3, 4, 5],
  "heads": [[4, 0, 0], [5, 0, 0]],
  "attrs": {"mxnet_version": ["int", 10200]}
}